# Online_Platforma
# **Задачі**

## **Задача 1. Базові SELECT**

1. Вивести всіх студентів, які зареєструвалися після 2024‑01‑01.
SELECT student_id, full_name, city,	reg_date 
FROM students
WHERE reg_date > '2024.01.01';


2. Вивести всі курси категорії `"Data Science"`.
SELECT course_id, course_name, category 
FROM courses
WHERE category = 'Data Science';

## **Задача 2. Групування та агрегація**

1. Порахувати кількість студентів у кожному місті.
![](task2_1.png)
2. Порахувати кількість курсів у кожній категорії.
![](task2_2.png)
3. Порахувати середню оцінку по кожному курсу.
![](task2_3.png)

## **Задача 3. JOIN‑аналіз**

1. Вивести список курсів разом з іменами викладачів.
![](task3_1.png)
2. Вивести студентів та назви курсів, на які вони записані.
![](task3_2.png)
3. Порахувати, скільки студентів у кожного викладача.
![](task3_3.png)

## **Задача 4. Аналітика прогресу**

1. Порахувати середню оцінку кожного студента.
![](task4_1.png)
2. Порахувати відсоток завершених уроків для кожного курсу.

3. Знайти студентів, які завершили всі уроки у своїх курсах.


## **Задача 5. Віконні функції**

1. Для кожного курсу визначити рейтинг студентів за середнім балом.

2. Порахувати кумулятивну кількість уроків, завершених студентом у хронологічн
